high-load.yml
config:
  target: "{{ $processEnvironment.TARGET_API }}"
  tls:
    rejectUnauthorized: false
    cert: "{{ $processEnvironment.CLIENT_CERT }}"
    key: "{{ $processEnvironment.CLIENT_KEY }}"
  processor: "./src/randomisor.js"
  phases:
    - duration: 540
      arrivalRate: 5
      rampTo: 200
  defaults:
    headers:
      Authorization: "Bearer {{ $processEnvironment.TOKEN }}"
  payload:
    -
      path: "./{{ $processEnvironment.SYSNUM }}"
      fields:
        - "systemNumber"
      cast: false
      skipHeader: true
    -
      path: "./{{ $processEnvironment.NAME_DOB }}"
      fields:
        - "forename"
        - "surname"
        - "dob"
      cast: false
      skipHeader: true
scenarios:
  - name: "System number search"
    flow:
    - get:
        url: "/api/v0/events/birth/{{ systemNumber }}"
    weight: 1
  - name: "Random system number search"
    flow:
    - function: "getSystemNumber"
    - get:
        url: "/api/v0/events/birth/{{ systemNumber }}"
    weight: 8
  - name: "Name/DoB search"
    flow:
    - get:
        url: "/api/v0/events/birth?forenames={{ forename }}&lastname={{ surname }}&dateofbirth={{ dob }}"
        capture:
          json: "$[0].systemNumber"
          as: "id"
    - get:
        url: "/api/v0/events/birth/{{ id }}"
    weight: 1
  - name: "random Name/DoB search"
    flow:
    - function: "getSearchTerms"
    - get:
        url: "/api/v0/events/birth?forenames={{ firstnames }}&lastname={{ surname }}&dateofbirth={{ dob }}"
    weight: 6